-- migrate:up
INSERT INTO
    `movie_type_properties` (`movie_type`)
VALUES
    ("2D"),
    ("2D ATMOS"),
    ("2D ATMOS(자막)"),
    ("2D Dolby(자막)"),
    ("2D(자막)"),
    ("3D Dolby(자막)"),
    ("3D(자막)"),
    ("2D(더빙)"),
    ("디지털가치봄");

INSERT INTO
    `movie` (`ko_title`, `en_title`, `description`, `viewer`, `movie_time`, `director`, `grade`, `actors`, `genre`, `release_date`, `movie_poster`)
VALUES
    ("데시벨", "Decibel", "소음이 커지는 순간 폭.발.한다", 0, 110, "황인호", "12세이상관람가", "김래원, 이종석, 정상훈, 박병은, 이상희, 조달환, 차은우, 이민기", "액션", "2022-11-16","test.png"),
    ("블랙 팬서: 와칸다 포에버", "Black Panther: Wakanda Forever", "와칸다를 지켜라!", 0, 161, "라이언 쿠글러", "12세이상관람가", "레티티아 라이트, 루피타 뇽오, 다나이 구리라, 안젤라 바셋, 테노치 우에르타 메히아, 윈스턴 듀크, 마틴 프리먼, 도미니크 손", "12세이상관람가", "2022-11-09","test.png"),
    ("동감", null, "1999년, '용은' 첫눈에 반하게 된 '한솔'을 사로잡기 위해", 0, null, "서은영", "12세이상관람가", "여진구, 조이현, 김혜윤, 나인우, 배인혁", null, "2022-11-16","test.png"),
    ("올빼미", null, "맹인이지만 뛰어난 침술 실력을 지닌 '경수'는", 0, 118, "안태진", "15세이상관람가", "류준열, 유해진, 최무성, 조성하, 박명훈, 김성철, 안은진, 조윤서", "스릴러", "2022-11-23","test.png"),
    ("폴: 600미터", "THE FALL", "사상 최초 고공 서바이벌", 0, 107, "스콧 만", "12세이상관람가", "그레이스 캐롤라인 커리, 버지니아 가드너, 제프리 딘 모건", "스릴러, 액션", "2022-11-16","test.png"),
    ("에브리씽 에브리웨어 올 앳 원스", "Everything Everywhere All At Once", "미국에 이민와 힘겹게 세탁소를 운영하던 에블린은 세무당국의 조사에 시달리던 어느 날", 0, 140, "다니엘 쉐이너트, 다니엘 콴", "15세이상관람가", "양자경, 스테파니 수, 키 호이 콴, 제이미 리 커티스", "액션, 코미디", "2022-10-12","test.png"),
    ("[워너필소] 엑소시스트: 디렉터스컷", "The Exorcist : The Version You&#39:ve Never Seen", "악령을 쫓으려는 신부의 처절한 사투를 다룬 <엑소시스트> 본편에 미공개 장면을 추가한 감독판", 0, 132, "윌리엄 프리드 킨", "15세이상관람가", "엘렌 버스틴, 막스 본 시도우", "공포(호러)", "2022-11-16","test.png"),
    ("프로메어", "Promare", "모든 것이 불타버릴 인류에 닥친 최대 위기!", 0, 111, "이마이시 히로유키", "15세이상관람가", "마츠야마 켄이치, 사카이 마사토", "애니메이션", "2022-10-20","test.png"),
    ("블로우백", "Blowback", "아픈 딸의 병원비가 절신한 닉은", 0, 94, "티보 타카스", "15세이상관람가", "캠 지갠뎃, 랜디 커투어", "스릴러, 액션", "2022-11-14","test.png"),
    ("자백", "Confession", "제대로 함정에 빠졌다!", 0, 105, "윤종석", "15세이상관람가", "소지섭, 김윤진, 나나, 최광일", "범죄, 스릴러", "2022-10-26","test.png"),
    ("살인청부업자", "HIT MAN", "인정사정없는 살인청부없자의", 0, 91, "강태호", "청소년관람불가", "정제우, 박지우, 고원석, 설재근, 이창욱, 서갑숙", "범죄, 스릴러", "2022-11-03","test.png"),
    ("극장판 짱구는 못말려: 수수께끼! 꽃피는 천하떡잎학교", "Crayon Shin-cahn: School Mystery! The Splendid Tenkasu Academy","짱구와 친구들, 명문학교에 입학하다?!",0, 105, "타카하시 와타루", "전체관람가", null, "애니메이션", "2022-09-28","test.png"),
    ("인생은 아름다워", "Life is Beautiful", "내 생애 가장 빛나는 선물", 0, 122, "최국희", "12세이상관람가", "류승룡, 염정아, 박세완, 옹성우", "뮤지컬", "2022-09-28","test.png"),
    ("리멤버", "REMEMBER", "부서진 차... 손에 묻은 피... 권총 한 자루... 내가 왜 여기에 있는거지?", 0, 128, "이일형", "15세이상관람가", "이성민, 남주혁", "드라마", "2022-10-26","test.png"),
    ("정직한 후보2", null, "거짓말 못하는 '진실의 주둥이' 컴백! 이번엔 2명?!", 0, 107, "장유정", "12세이상관람가", "라미란, 김무열, 윤경호, 서현우, 박진주, 윤두준", "코미디", "2022-09-28","test.png"),
    ("극장판 유루캠△", null, "이것은 조금 먼 미래의 겨울부터 시작되는 이야기", 0, 120, "쿄고쿠 요시아키", "전체관람가", "하나모리 유미리, 토야마 나오, 타카하시 리에, 하라 사유리, 토요사키 아키", "드라마, 애니메이션", "2022-10-27","test.png"),
    ("가재가 노래하는 곳", "Where the Crawdads Sing", "습지 소녀로 불리는 한 여자, 살인사건의 유력한 용의자로 지목되다.", 0, 125, "올리비아 뉴먼", "15세이상관람가", "데이지 에드가 존스, 테일러 존 스미스, 해리스 딕킨슨, 데이빗 스트라탄, 가렛딜라헌트", "드라마", "2022-11-02","test.png"),
    ("파이어버드", "Firebird", "1977년 냉전 시대의 에스토니아", 0, 107, "피터 리베인", "15세이상관람가", "톰 프라이어, 올렉 자고로드니, 다이애나 포자르스카, 재이크 헨더슨, 마르구스 프랑겔, 니콜라스 우더슨", "전쟁", "2022-11-17","test.png"),
    ("[ROH 오페라] 아이다", "[ROH OPERA] AIDA", "새롭게 탄생된 베르디의 정치 드라마", 0, 188, null, "전체관람가", null, "공연", "2022-11-21","test.png"),
    ("수프와 이데올로기", "Soup and Ideology", "일본인 사위를 극구 반대하던 부모님.", 0, 118, "양영회", "12세이상관람가", "강정희, 양영회, 아라이, 카오루", "다큐멘터리", "2022-10-20","test.png"),
    ("같은 속옷을 입는 두 여자", "The Apartment with Two Women", "여느 날과 다름없이 다투던 중", 0, 140, "김세인", "15세이상관람가", "임지호, 양말복, 양흥주, 정보람", "드라마", "2022-11-10","test.png"),
    ("[워너필소] 브이 포 벤데타", "V For Vendetta", null, 0, 132, "제임스 맥티그", "15세이상관람가", "나탈리 포트만, 휴고 위빙", "액션", "2022-11-02","test.png"),
    ("블랙 아담", "Black Adam", "누구도 막을 수 없다!", 0, 124, "자움 콜렛 세라", "12세이상관람가", "드웨인 존슨, 노아 센티네오, 피어스 브로스넌, 퀸테사 스윈들, 알디스 호지, 사라 샤이", "SF, 액션, 어드벤처", "2022-10-19","test.png"),
    ("트랜스", "Trans", "트랜스휴머니즘이라고 들어봤니?", 0, 92, "도내리", "15세이상관람가", null, "SF, 미스터리, 스릴러, 판타지", "2022-11-17","test.png"),
    ("[오페라] 햄릿 @The Met", "Hamlet @The Met", "유려한 현대음악, 쟁쟁한 가수들의 불꽃 튀는 경연!", 0, 194, null, "12세이상관람가", null, "공연", "2022-10-11","test.png");

INSERT INTO
    `movie_type` (movie_id, movie_type_properties_id)
VALUES
    (1, 1), (1, 2), (2, 3), (2, 4), (2, 5), (2, 6), (2, 7), (3, 1), (4, 1), (5, 5), (6, 3), (6, 5), (7, 5), (8, 5), (9, 5), (10, 1), (11, 1), (12, 8), (13, 1), (13, 2), (13, 9),
    (14, 1), (15, 1), (15, 9), (16, 5), (17, 5), (18, 5), (19, 5), (20, 1), (21, 1), (22, 5), (23, 3), (23, 4), (23, 5), (24, 1), (25, 5);

-- migrate:down
SET foreign_key_checks = 0;
TRUNCATE TABLE movie_type_properties;
TRUNCATE TABLE movie;
TRUNCATE TABLE movie_type;
SET foreign_key_checks = 1;
